#pragma once

//==============================================================
//ゲームの設定
//==============================================================

//目標点
const int TARGET_SCORE = 21;

//バーストになる点数
const int BURST_SCORE = 22;


//CPUが自動でカードを引く上限
const int CPU_DRAW_LIMIT = 15;

//==============================================================
// カードの設定
//==============================================================

//カードの最小値
const int CARD_MIN = 1;

//カードの最大値
const int CARD_MAX = 11;

//同じ数字のカード枚数
const int CARD_DUPLICATE_COUNT = 4;

//カードの総枚数
const int CARD_TOTAL = 44;

//最初に配られるカード枚数
const int INTTAL_CARD_COUNT = 2;


//==============================================================
// プレイヤーの選択
//============================================================== 

//カードを引く
const int INPUT_YES = 0;
//カードを引かない
const int INPUT_NO = 1;